[
    {
        "course_number": "100",
        "name": "MATH 100 D100",
        "prerequisites": "Pre-Calculus 11 or Foundations of Mathematics 11 (or equivalent) with a grade of at least B or Pre-Calculus 12 (or equivalent), with a grade of at least C and SFU FAN credit, or SFU FAN X92 or FAN X99 course with a grade of at least B-, or achieving a satisfactory grade on the Simon Fraser University Quantitative Placement Test."
    },
    {
        "course_number": "110",
        "name": "MATH 110 D100",
        "prerequisites": "Foundations of Mathematics 11 (or equivalent) with a grade of at least B, or Pre-Calculus 12 (or equivalent) with a grade of at least C and an SFU FAN credit, or SFU FAN X92 or X99 course with a grade of at least B-, or achieving a satisfactory grade on the Simon Fraser University Quantitative Placement Test."
    },
    {
        "course_number": "150",
        "name": "MATH 150 D100",
        "prerequisites": "Pre-Calculus 12 (or equivalent) with a grade of at least B+, or MATH 100 with a grade of at least B-."
    },
    {
        "course_number": "151",
        "name": "MATH 151 D100",
        "prerequisites": "Pre-Calculus 12 (or equivalent) with a grade of at least A, or MATH 100 with a grade of at least B."
    },
    {
        "course_number": "152",
        "name": "MATH 152 D100",
        "prerequisites": "MATH 150 or 151 or 155, with a minimum grade of C-; or MATH 154 or 157, with a grade of at least B."
    },
    {
        "course_number": "154",
        "name": "MATH 154 D100",
        "prerequisites": "Pre-Calculus 12 (or equivalent) with a grade of at least B, or MATH 100 with a grade of at least C-, or MATH 110 with a grade of at least C-."
    },
    {
        "course_number": "157",
        "name": "MATH 157 D100",
        "prerequisites": "Pre-Calculus 12 (or equivalent) with a grade of at least B, or MATH 100 with a grade of at least C, or MATH 110 with a grade of at least C."
    },
    {
        "course_number": "190",
        "name": "MATH 190 B100",
        "prerequisites": "Pre-Calculus 11 or Foundations of Mathematics 11 (or equivalent)\r\nwith a grade of at least B, or SFU FAN X99 course with a grade of at least C, or achieving a satisfactory grade on the Simon Fraser University Quantitative Placement Test. This course may not be counted toward the Mathematics minor, major or honours degree requirements. Students who have taken, have received transfer credit for, or are currently taking MATH 150, 151, 154 or 157 may not take MATH 190 for credit without permission from the Department of Mathematics. Intended to be particularly accessible to students who are not specializing in mathematics."
    },
    {
        "course_number": "232",
        "name": "MATH 232 D100",
        "prerequisites": "MATH 150 or 151 or MACM 101, with a minimum grade of C-; or MATH 154 or 157, both with a grade of at least B."
    },
    {
        "course_number": "240",
        "name": "MATH 240 D100",
        "prerequisites": "MATH 150 or 151 or MACM 101, with a minimum grade of C-; or MATH 154 or 157, both with a grade of at least B."
    },
    {
        "course_number": "251",
        "name": "MATH 251 D100",
        "prerequisites": "MATH 152 with a minimum grade of C-; or MATH 158 with a grade of at least B. Also, for students in the life sciences, MATH 154 with a minimum grade of C- and MATH 155 with a minimum grade of A-. Recommended: It is recommended that MATH 240 or 232 be taken before or concurrently with MATH 251."
    },
    {
        "course_number": "260",
        "name": "MATH 260 D100",
        "prerequisites": "MATH 152 with a minimum grade of C-; or MATH 155 or 158, with a grade of at least B; MATH 232 or 240, with a minimum grade of C-."
    },
    {
        "course_number": "292",
        "name": "MATH 292 D100",
        "prerequisites": "Prerequisites will be specified according to the particular topic or topics offered."
    },
    {
        "course_number": "301",
        "name": "MATH 301 E100",
        "prerequisites": "MATH 152 or 155 or 158, and MATH 232 or 240, all with a minimum grade of C-. There may be additional prerequisites depending on the specific course topic."
    },
    {
        "course_number": "308",
        "name": "MATH 308 D100",
        "prerequisites": "MATH 150, 151, 154, or 157 and MATH 240 or 232, all with a minimum grade of C-."
    },
    {
        "course_number": "309",
        "name": "MATH 309 D100",
        "prerequisites": "MATH 232 or 240, and 251, all with a minimum grade of C-."
    },
    {
        "course_number": "322",
        "name": "MATH 322 D100",
        "prerequisites": "MATH 251 with a minimum grade of C-."
    },
    {
        "course_number": "336",
        "name": "MATH 336 D100",
        "prerequisites": "Students must apply to and receive permission from the co-op co-ordinator at least one, preferably two, terms in advance. They will normally be required to have completed 45 units with a GPA of 2.5. This course will be graded on a pass/withdraw basis. A course fee is required."
    },
    {
        "course_number": "337",
        "name": "MATH 337 D100",
        "prerequisites": "MATH 336 and permission of the co-op co-ordinator; students must apply at least one term in advance."
    },
    {
        "course_number": "340",
        "name": "MATH 340 D100",
        "prerequisites": "MATH 240 with a minimum grade of C- or MATH 232 with a grade of at least B."
    },
    {
        "course_number": "345",
        "name": "MATH 345 D100",
        "prerequisites": "MACM 201 with a minimum grade of C-."
    },
    {
        "course_number": "360",
        "name": "MATH 360 D100",
        "prerequisites": "MATH 260 with a minimum grade of C- or (MATH 155 with a minimum grade of A- and BISC 204 with a minimum grade of C-). Corequisite: BISC 204 may be taken as a corequisite. Strongly Recommended: Experience with a computing platform such as R, MATLAB, or Python."
    },
    {
        "course_number": "418",
        "name": "MATH 418 D100",
        "prerequisites": "(MATH 260 or MATH 310) and one of MATH 314, MATH 320, MATH 322, PHYS 384, all with a minimum grade of C-. An alternative to the above prerequisite is both of (MATH 252 or MATH 254) and (MATH 260 or MATH 310), both with grades of at least A-."
    },
    {
        "course_number": "425",
        "name": "MATH 425 D100",
        "prerequisites": "MATH 320 with a minimum grade of C-."
    },
    {
        "course_number": "436",
        "name": "MATH 436 D100",
        "prerequisites": "MATH 337 and permission of the co-op co-ordinator; students must apply at least one term in advance."
    },
    {
        "course_number": "437",
        "name": "MATH 437 D100",
        "prerequisites": "MATH 436 and permission of the co-op co-ordinator; students must apply at least one term in advance."
    },
    {
        "course_number": "480w",
        "name": "MATH 480W D100",
        "prerequisites": "MACM 201 with a grade of at least B. At least one of MACM 201, MATH 240, MATH 242, MATH 251, MATH 252 with a grade of at least A, or both of MACM 203, MACM 204 with a grade of at least A. Or permission of the instructor."
    },
    {
        "course_number": "486",
        "name": "MATH 486 D100",
        "prerequisites": "MATH 437 and permission of the co-op co-ordinator. Students must apply at least one term in advance."
    },
    {
        "course_number": "498",
        "name": "MATH 498 D100",
        "prerequisites": ""
    },
    {
        "course_number": "499w",
        "name": "MATH 499W D100",
        "prerequisites": "18 units of upper division MATH or MACM courses. Must be in an honours program with a GPA of at least 3.0. Corequisite: MATH 498. Students must have an approved project prior to enrollment."
    },
    {
        "course_number": "709",
        "name": "MATH 709 G100",
        "prerequisites": ""
    },
    {
        "course_number": "718",
        "name": "MATH 718 G100",
        "prerequisites": ""
    },
    {
        "course_number": "725",
        "name": "MATH 725 G100",
        "prerequisites": ""
    },
    {
        "course_number": "742",
        "name": "MATH 742 G100",
        "prerequisites": ""
    },
    {
        "course_number": "817",
        "name": "MATH 817 G100",
        "prerequisites": ""
    },
    {
        "course_number": "820",
        "name": "MATH 820 G100",
        "prerequisites": ""
    },
    {
        "course_number": "877",
        "name": "MATH 877 G100",
        "prerequisites": ""
    },
    {
        "course_number": "879",
        "name": "MATH 879 G100",
        "prerequisites": ""
    },
    {
        "course_number": "880",
        "name": "MATH 880 G100",
        "prerequisites": ""
    },
    {
        "course_number": "890",
        "name": "MATH 890 G100",
        "prerequisites": ""
    },
    {
        "course_number": "891",
        "name": "MATH 891 G100",
        "prerequisites": ""
    },
    {
        "course_number": "894",
        "name": "MATH 894 G100",
        "prerequisites": ""
    },
    {
        "course_number": "895",
        "name": "MATH 895 G100",
        "prerequisites": ""
    },
    {
        "course_number": "898",
        "name": "MATH 898 G100",
        "prerequisites": ""
    },
    {
        "course_number": "899",
        "name": "MATH 899 G100",
        "prerequisites": ""
    }
]